const hanyeong=function(){
    const one={
        "ㄱ": "ᆨ",
        "ㄲ": "ᆩ",
        "ㄳ": "ᆪ",
        "ㄴ": "ᆫ",
        "ㄵ": "ᆬ",
        "ㄶ": "ᆭ",
        "ㄷ": "ᆮ",
        "ㄸ": "ㄸ",
        "ㄹ": "ᆯ",
        "ㄺ": "ᆰ",
        "ㄻ": "ᆱ",
        "ㄼ": "ᆲ",
        "ㄽ": "ᆳ",
        "ㄾ": "ᆴ",
        "ㄿ": "ᆵ",
        "ㅀ": "ᆶ",
        "ㅁ": "ᆷ",
        "ㅂ": "ᆸ",
        "ㅃ": "ㅃ",
        "ㅄ": "ᆹ",
        "ㅅ": "ᆺ",
        "ㅆ": "ᆻ",
        "ㅇ": "ᆼ",
        "ㅈ": "ᆽ",
        "ㅉ": "ㅉ",
        "ㅊ": "ᆾ",
        "ㅋ": "ᆿ",
        "ㅌ": "ᇀ",
        "ㅍ": "ᇁ",
        "ㅎ": "ᇂ"
    };
    const two={
        "ㄱㄱ":"ᆩ",
        "ㄱㅅ":"ᆪ",
        "ㄴㅈ":"ᆬ",
        "ㄴㅎ":"ᆭ",
        "ㄷㄷ":"ㄸ",
        "ㄹㄱ":"ᆰ",
        "ㄹㅁ":"ᆱ",
        "ㄹㅂ":"ᆲ",
        "ㄹㅅ":"ᆳ",
        "ㄹㅌ":"ᆴ",
        "ㄹㅍ":"ᆵ",
        "ㄹㅎ":"ᆶ",
        "ㅂㅂ":"ㅃ",
        "ㅂㅅ":"ᆹ",
        "ㅅㅅ":"ᆻ",
        "ㅈㅈ":"ㅉ"
    };
    const en={
        "q": "ㅂ",
        "w": "ㅈ",
        "e": "ㄷ",
        "r": "ㄱ",
        "t": "ㅅ",
        "y": "ㅛ",
        "u": "ㅕ",
        "i": "ㅑ",
        "o": "ㅐ",
        "p": "ㅔ",
        "a": "ㅁ",
        "s": "ㄴ",
        "d": "ㅇ",
        "f": "ㄹ",
        "g": "ㅎ",
        "h": "ㅗ",
        "j": "ㅓ",
        "k": "ㅏ",
        "l": "ㅣ",
        "z": "ㅋ",
        "x": "ㅌ",
        "c": "ㅊ",
        "v": "ㅍ",
        "b": "ㅠ",
        "n": "ㅜ",
        "m": "ㅡ",
        "Q": "ㅃ",
        "W": "ㅉ",
        "E": "ㄸ",
        "R": "ㄲ",
        "T": "ㅆ",
        "Y": "ㅛ",
        "U": "ㅕ",
        "I": "ㅑ",
        "O": "ㅒ",
        "P": "ㅖ",
        "A": "ㅁ",
        "S": "ㄴ",
        "D": "ㅇ",
        "F": "ㄹ",
        "G": "ㅎ",
        "H": "ㅗ",
        "J": "ㅓ",
        "K": "ㅏ",
        "L": "ㅣ",
        "Z": "ㅋ",
        "X": "ㅌ",
        "C": "ㅊ",
        "V": "ㅍ",
        "B": "ㅠ",
        "N": "ㅜ",
        "M": "ㅡ"
    };
    const mo={
        "ㅗㅏ":"ㅘ",
        "ㅗㅐ":"ㅙ",
        "ㅗㅣ":"ㅚ",
        "ㅜㅓ":"ㅝ",
        "ㅜㅔ":"ㅞ",
        "ㅜㅣ":"ㅟ",
        "ㅡㅣ":"ㅢ"
    };
    function toZong(x){
        if(x.length==2){
            return one[x[0]]+x[1];
        }else{
            if(two[x.slice(0,2)]!==undefined){
                return two[x.slice(0,2)]+x.slice(2);
            }else{
                return one[x[0]]+x.slice(1);
            }
        }
    }
    function 결합(x){
        return x.split(" ").map(x=>x
            .replace(/[ㄱ-ㅎ]{2}$/gi,x=>two[x]?two[x]:x)
            .replace(/[ㅛㅕㅑㅐㅔㅗㅓㅏㅣㅠㅜㅡㅒㅖ]{2}/g,x=>mo[x]?mo[x]:x)
            .replace(/[ㄱ-ㅎ]$/gi,x=>one[x]?one[x]:x)
            .replace(/[ㄱ-ㅎ][ㄱ-ㅎ]+/g,toZong)
            .normalize("NFKC")).join(" ");
    }
    function 변환(x){
        return x.split("").map(x=>en[x]?en[x]:x).join("");
    }
    return function(x){
        return 결합(변환(x.toString()));
    };
}();
